ARMmbed/mbed-os/targets/TARGET_STM/TARGET_STM32F7/TARGET_STM32F777xI/TARGET_TAPIT_MODULE_1_2/PeripheralPins.c
/* mbed Microcontroller Library
 * SPDX-License-Identifier: BSD-3-Clause
 ******************************************************************************
 *
 * Copyright (c) 2016-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 *
 * Automatically generated from STM32CubeMX/db/mcu/STM32F777BITx.xml
 */

#include "PeripheralPins.h"
#include "mbed_toolchain.h"

//==============================================================================
// Notes
//
// - The pins mentioned Px_y_ALTz are alternative possibilities which use other
//   HW peripheral instances. You can use them the same way as any other "normal"
//   pin (i.e. PwmOut pwm(PA_7_ALT0);). These pins are not displayed on the board
//   pinout image on mbed.org.
//
// - The pins which are connected to other components present on the board have
//   the comment "Connected to xxx". The pin function may not work properly in this
//   case. These pins may not be displayed on the board pinout image on mbed.org.
//   Please read the board reference manual and schematic for more information.
//
// - Warning: pins connected to the default STDIO_UART_TX and STDIO_UART_RX pins are commented
//   See https://os.mbed.com/teams/ST/wiki/STDIO for more information.
//
//==============================================================================


//*** GPIO ***

MBED_WEAK const PinMap PinMap_GPIO[] = {
    {PA_0,  0, 0},
    {PA_1,  0, 0}, // Connected to ETH_REF_CLK
    {PA_2,  0, 0}, // Connected to ETH_MDIO
    {PA_3,  0, 0},
    {PA_4,  0, 0}, // Connected to B8_3
    {PA_5,  0, 0}, // Connected to B8_4
    {PA_6,  0, 0}, // Connected to B8_2
    {PA_7,  0, 0}, // Connected to ETH_CRS_DV
    {PA_8,  0, 0},
    {PA_9,  0, 0}, // Connected to USB_OTG_FS_VBUS
    {PA_10, 0, 0}, // Connected to USB_OTG_FS_ID
    {PA_11, 0, 0}, // Connected to USB_OTG_FS_DM
    {PA_12, 0, 0}, // Connected to USB_OTG_FS_DP
    {PA_13, 0, 0}, // Connected to SYS_JTMS-SWDIO
    {PA_14, 0, 0}, // Connected to SYS_JTCK-SWCLK
    {PA_15, 0, 0}, // Connected to RED_LED
    {PB_0,  0, 0}, // Connected to B8_1
    {PB_1,  0, 0}, // Connected to FLOW8
    {PB_2,  0, 0}, // Connected to SOL8
    {PB_3,  0, 0}, // Connected to SYS_JTDO-SWO
    {PB_4,  0, 0},
    {PB_5,  0, 0},
    {PB_6,  0, 0}, // Connected to QUADSPI_BK1_NCS
    {PB_7,  0, 0},
    {PB_8,  0, 0},
    {PB_9,  0, 0},
    {PB_10, 0, 0}, // Connected to B4_1
    {PB_11, 0, 0}, // Connected to FLOW4
    {PB_12, 0, 0}, // Connected to B2_4
    {PB_13, 0, 0}, // Connected to ETH_TXD1
    {PB_14, 0, 0}, // Connected to B2_2
    {PB_15, 0, 0}, // Connected to B2_1
    {PC_0,  0, 0},
    {PC_1,  0, 0}, // Connected to ETH_MDC
    {PC_2,  0, 0},
    {PC_3,  0, 0},
    {PC_4,  0, 0}, // Connected to ETH_RXD0
    {PC_5,  0, 0}, // Connected to ETH_RXD1
    {PC_6,  0, 0},
    {PC_7,  0, 0},
    {PC_8,  0, 0},
    {PC_9,  0, 0},
    {PC_10, 0, 0},
    {PC_11, 0, 0},
    {PC_12, 0, 0},
    {PC_13, 0, 0}, // Connected to CAN_RS
//  {PC_14, 0, 0}, // Connected to RCC_OSC32_IN
//  {PC_15, 0, 0}, // Connected to RCC_OSC32_OUT
    {PD_0,  0, 0}, // Connected to CAN1_RX
    {PD_1,  0, 0}, // Connected to CAN1_TX
    {PD_2,  0, 0},
    {PD_3,  0, 0}, // Connected to FW1
    {PD_4,  0, 0}, // Connected to FW2
    {PD_5,  0, 0}, // Connected to FW3
    {PD_6,  0, 0}, // Connected to GEREEN_LED
    {PD_7,  0, 0}, // Connected to BLUE_LED
    {PD_8,  0, 0}, // Connected to USART3_TX
    {PD_9,  0, 0}, // Connected to USART3_RX
    {PD_10, 0, 0}, // Connected to SOL2
    {PD_11, 0, 0}, // Connected to FLOW2
    {PD_12, 0, 0}, // Connected to TEMP1
    {PD_13, 0, 0},
    {PD_14, 0, 0},
    {PD_15, 0, 0},
    {PE_0,  0, 0},
    {PE_1,  0, 0},
    {PE_2,  0, 0}, // Connected to QUADSPI_BK1_IO2
    {PE_3,  0, 0},
    {PE_4,  0, 0},
    {PE_5,  0, 0},
    {PE_6,  0, 0},
    {PE_7,  0, 0}, // Connected to B5_4
    {PE_8,  0, 0}, // Connected to B5_2
    {PE_9,  0, 0}, // Connected to B5_1
    {PE_10, 0, 0},
    {PE_11, 0, 0}, // Connected to FLOW5
    {PE_12, 0, 0}, // Connected to SOL5
    {PE_13, 0, 0}, // Connected to B4_3
    {PE_14, 0, 0}, // Connected to B4_4
    {PE_15, 0, 0}, // Connected to B4_2
    {PF_0,  0, 0}, // Connected to I2C2_SDA
    {PF_1,  0, 0}, // Connected to I2C2_SCL
    {PF_2,  0, 0},
    {PF_3,  0, 0}, // Connected to CURRENT_OUT
    {PF_4,  0, 0}, // Connected to VOLTAGE_OUT
    {PF_5,  0, 0},
    {PF_6,  0, 0}, // Connected to QUADSPI_BK1_IO3
    {PF_7,  0, 0},
    {PF_8,  0, 0}, // Connected to QUADSPI_BK1_IO0
    {PF_9,  0, 0}, // Connected to QUADSPI_BK1_IO1
    {PF_10, 0, 0}, // Connected to QUADSPI_CLK
    {PF_11, 0, 0}, // Connected to B6_3
    {PF_12, 0, 0}, // Connected to B6_4
    {PF_13, 0, 0}, // Connected to B6_2
    {PF_14, 0, 0}, // Connected to B6_1
    {PF_15, 0, 0}, // Connected to FLOW6
    {PG_0,  0, 0}, // Connected to SOL6
    {PG_1,  0, 0}, // Connected to B5_3
    {PG_2,  0, 0},
    {PG_3,  0, 0},
    {PG_4,  0, 0},
    {PG_5,  0, 0},
    {PG_6,  0, 0}, // Connected to USB_GPIO_IN
    {PG_7,  0, 0}, // Connected to USB_GPIO_OUT
    {PG_8,  0, 0},
    {PG_9,  0, 0},
    {PG_10, 0, 0},
    {PG_11, 0, 0}, // Connected to ETH_TX_EN
    {PG_12, 0, 0},
    {PG_13, 0, 0}, // Connected to ETH_TXD0
    {PG_14, 0, 0},
    {PG_15, 0, 0},
//  {PH_0,  0, 0}, // Connected to RCC_OSC_IN
//  {PH_1,  0, 0}, // Connected to RCC_OSC_OUT
    {PH_2,  0, 0},
    {PH_3,  0, 0},
    {PH_4,  0, 0},
    {PH_5,  0, 0},
    {PH_6,  0, 0}, // Connected to B3_3
    {PH_7,  0, 0}, // Connected to B3_4
    {PH_8,  0, 0}, // Connected to B3_2
    {PH_9,  0, 0}, // Connected to B3_1
    {PH_10, 0, 0}, // Connected to SOL3
    {PH_11, 0, 0}, // Connected to FLOW3
    {PH_12, 0, 0}, // Connected to B2_3
    {PH_13, 0, 0},
    {PH_14, 0, 0},
    {PH_15, 0, 0},
    {PI_0,  0, 0},
    {PI_1,  0, 0},
    {PI_2,  0, 0},
    {PI_3,  0, 0},
    {PI_4,  0, 0},
    {PI_5,  0, 0},
    {PI_6,  0, 0},
    {PI_7,  0, 0},
    {PI_8,  0, 0},
    {PI_9,  0, 0},
    {PI_10, 0, 0},
    {PI_11, 0, 0},
    {PI_12, 0, 0},
    {PI_13, 0, 0},
    {PI_14, 0, 0},
    {PI_15, 0, 0}, // Connected to B7_3
    {PJ_0,  0, 0}, // Connected to B7_4
    {PJ_1,  0, 0}, // Connected to B7_2
    {PJ_2,  0, 0}, // Connected to B7_1
    {PJ_3,  0, 0}, // Connected to FLOW7
    {PJ_4,  0, 0}, // Connected to SOL7
    {PJ_5,  0, 0}, // Connected to SOL4
    {PJ_6,  0, 0}, // Connected to B1_1
    {PJ_7,  0, 0}, // Connected to B1_2
    {PJ_8,  0, 0}, // Connected to B1_4
    {PJ_9,  0, 0}, // Connected to B1_3
    {PJ_10, 0, 0}, // Connected to SOL1
    {PJ_11, 0, 0}, // Connected to FLOW1
    {PJ_12, 0, 0},
    {PJ_13, 0, 0},
    {PJ_14, 0, 0},
    {PJ_15, 0, 0},
    {PK_0,  0, 0},
    {PK_1,  0, 0},
    {PK_2,  0, 0},
    {PK_3,  0, 0},
    {PK_4,  0, 0},
    {PK_5,  0, 0},
    {PK_6,  0, 0},
    {PK_7,  0, 0},
    {NC, NC, 0}
};

//*** ADC ***

